onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ1_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДЗ1_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ1_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ Добавить на форму  Скидка и кнопку Пересчитать для нового документа
	Если Элементы.Найти("КонтактноеЛицо") =  Неопределено Тогда
		ДЗ1_ДобавитьПоляРеквизитов();
	КонецЕсли
	//--
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	//++ Добавить на форму  Скидка и кнопку Пересчитать если документ создан
	Если Элементы.Найти("КонтактноеЛицо") =  Неопределено Тогда
		ДЗ1_ДобавитьПоляРеквизитов();
	КонецЕсли
	//--
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	
	//++ Вычисление применения скидки
	ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.ДЗ1_СогласованнаяСкидка;
	Если ОбщаяСкидка > 100 Тогда  
		                                                           
		
	    ТипТовар = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Товар");
		ТипУслуга = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга");
		ТипНоменклатуры = ДЗ1_ПолучитьТипНоменклатурыНаСервере (ТекущиеДанные.Номенклатура); 

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка скидка в %1 на %2 превышает 100 процентов", ОбщаяСкидка, ТекущиеДанные.Номенклатура); 
		Строка = ТекущиеДанные.НомерСтроки - 1; 
		
		Если ТипНоменклатуры = ТипТовар Тогда
			Сообщение.Поле = "Объект.Товары["+Строка+"].Скидка"; 															 
		КонецЕсли;	
		
		Если ТипНоменклатуры = ТипУслуга Тогда
			Сообщение.Поле = "Объект.Услуги["+Строка+"].Скидка"; 															 
		КонецЕсли; 
		
		Сообщение.Сообщить();                                                 
		ТекущиеДанные.Сумма = 0; 
		                                                             
		Возврат;
	КонецЕсли; 

	КоэффициентСкидки = 1 - ОбщаяСкидка / 100;

	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;     
	
	РассчитатьСуммуДокумента(); 
	//--


	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ДЗ1_ПолучитьТипНоменклатурыНаСервере (Ссылка) 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ВидНоменклатуры;
	
КонецФункции


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма"); 
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти






&НаКлиенте
Процедура ДЗ1_ПересчитатьТаблицыДокумента()
	//Пересчет таблиц Товары и Услуги  
	
	ДЗ1_ПересчитатьТаблицу(Объект.Товары);
	ДЗ1_ПересчитатьТаблицу(Объект.Услуги); 		  
	
КонецПроцедуры

&НаКлиенте
Процедура ДЗ1_ПересчитатьТаблицу(Таблица)
	//Построчный пересчет указанной таблицы
	
	Для Каждого СтрокаТЧ Из Таблица Цикл  
		
		//@skip-check query-in-loop
		РассчитатьСуммуСтроки(СтрокаТЧ);
		
	КонецЦикла;
	
	
КонецПроцедуры



&НаСервере
Процедура ДЗ1_ДобавитьПоляРеквизитов(); 
	
	
	//Добавление Элемента Контактное лицо
	НовыйЭлемент = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.ДЗ1_КонтактноеЛицо"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Контактное Лицо";  
	ЭтаФорма.Элементы.Переместить(НовыйЭлемент, ЭтаФорма.Элементы.ГруппаШапкаПраво, ЭтаФорма.Элементы.Контрагент);  
	
	//Добавление группы для элементов Согласованая скидки и кнопки пересчитать
	НоваяГруппа = ЭтаФорма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),ЭтаФорма.Элементы.ГруппаШапкаЛево);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;


	//Добавление Элемента СогласованаяСкидка в группу ГруппаСкидка
	НовыйЭлемент = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаСкидка);
	НовыйЭлемент.ПутьКДанным = "Объект.ДЗ1_СогласованнаяСкидка"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Согласованная Скидка";       
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ДЗ1_СогласованнаяСкидкаВопросПользователю");
	
	//Добавление Кнопки ПересчитатьТаблицу в группу ГруппаСкидка
	НовыйЭлемент = Команды.Добавить("ПересчитатьТаблицу");
	НовыйЭлемент.Заголовок = "ПересчитатьТаблицу";
	НовыйЭлемент.Действие  = "ДЗ1_ПересчитатьВсеТаблицы";
	НовыйЭлемент.Подсказка = "ПересчитатьТаблицу";  
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Обновить; 
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("Пересчитать", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ГруппаСкидка);
	НовыйЭлемент.ИмяКоманды = "ПересчитатьТаблицу";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;	
 
	
КонецПроцедуры
  

&НаКлиенте
Процедура ДЗ1_СогласованнаяСкидкаВопросПользователю(Элемент)
	//Если таблица не пустая предложить пересчитать ее 
	
	Если Объект.Товары.Количество() + Объект.Услуги.Количество() > 0 Тогда
		ЗапросПользователю() 
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Асинх Процедура ЗапросПользователю(); 
	//Вызов формы Да/Нет
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Ждать ВопросАсинх("Пересчитать скидку в документе?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		ДЗ1_ПересчитатьТаблицыДокумента()    
		
	КонецЕсли; 
	
КонецПроцедуры
